# Инструкция:
# Запросите у пользователя тип членства ("золото", "серебро" или "обычный:").
# Запросите сумму покупки.
# Примените скидки:
# Золотые участники получают 20% скидку при покупке выше 100$, иначе 10%.
# Серебряные участники получают 15% скидку при покупке выше 100$, иначе 5%.
# Обычные покупатели получают 5% скидку при покупке выше 100$, иначе скидки нет.

membership = input("Тип членство(золото, серебро, обычный):").strip().lower()
amount = float(input("Сумма покупки:"))

if membership == "золото":
    if amount > 100:   
        discount = 0.20
    else:
        discount = 0.10
        
elif membership == "серебро":
    if amount > 100:
        discount = 0.15
    else:
        discount = 0.05
elif membership == "обычный":
    if amount > 100:
        discount = 0.05
    else:
        discount = 0
else:
    discount = 0
    print("Некорректный тип членства.")
    
    print(f"Ваша скидка:{discount*100}%")